In [ ]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [28]:
path = 'train.csv'

df = pd.read_csv(path)
#df.head()

In [29]:
df.drop(['PassengerId','Name','Ticket'], axis=1,inplace=True)

In [30]:
from read_file import read_file
read_file(path)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
def chk_types(df):
    dtypes = df.dtypes
    n_unique = df.nunique()
    return pd.DataFrame({'dtypes': dtypes, 'n_unique': n_unique}).transpose()
chk_types(df)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
dtypes,int64,int64,object,float64,int64,int64,float64,object,object
n_unique,2,3,2,88,7,7,248,147,3

In [60]:
from process import chk_types
chk_types(df)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
dtypes,category,category,category,float64,category,category,float64,category
n_unique,2,3,2,63,4,4,93,3

In [61]:
cols = ['Survived' , 'Pclass' ,'Sex' , 'Parch' , 'SibSp' , 'Embarked']
df[cols] = df[cols].astype('category')
chk_types(df)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
dtypes,category,category,category,float64,category,category,float64,category
n_unique,2,3,2,63,4,4,93,3

In [62]:
null = df.isnull().sum()
print("Missing value count:")
ratio = ((null / df.shape[0]) * 100).round(2).astype(str) + '%'
pd.DataFrame({'Null_sum': null, 'Null_ratio %': ratio}).T

Missing value count:

             Survived Pclass   Sex   Age SibSp Parch  Fare Embarked
Null_sum            0      0     0     0     0     0     0        0
Null_ratio %     0.0%   0.0%  0.0%  0.0%  0.0%  0.0%  0.0%     0.0%

In [65]:
df1 = df.dropna(subset=['Embarked'])
df2 = df1.copy()  # 'Cabin' column is already dropped, so just copy df1

In [66]:
df.shape

(183, 8)

In [67]:
median = df1['Age'].median()
df1['Age'].fillna(median, inplace=True)

C:\Users\wifi\AppData\Local\Temp\ipykernel_11704\1865313400.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['Age'].fillna(median, inplace=True)

In [68]:
df.head(20)

    Survived Pclass     Sex   Age SibSp Parch      Fare Embarked
1          1      1  female  38.0     1     0   71.2833        C
3          1      1  female  35.0     1     0   53.1000        S
6          0      1    male  54.0     0     0   51.8625        S
10         1      3  female   4.0     1     1   16.7000        S
11         1      1  female  58.0     0     0   26.5500        S
21         1      2    male  34.0     0     0   13.0000        S
23         1      1    male  28.0     0     0   35.5000        S
27         0      1    male  19.0     3     2  263.0000        S
52         1      1  female  49.0     1     0   76.7292        C
54         0      1    male  65.0     0     1   61.9792        C
62         0      1    male  45.0     1     0   83.4750        S
66         1      2  female  29.0     0     0   10.5000        S
75         0      3    male  25.0     0     0    7.6500        S
88         1      1  female  23.0     3     2  263.0000        S
92         0      1    male  46.0     1     0   61.1750        S
96         0      1    male  71.0     0     0   34.6542        C
97         1      1    male  23.0     0     1   63.3583        C
102        0      1    male  21.0     0     1   77.2875        S
110        0      1    male  47.0     0     0   52.0000        S
118        0      1    male  24.0     0     1  247.5208        C